app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" IS NULL AND "users"."email" IS NULL LIMIT 1
SELECT  1 AS one FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "qwe"]]
---
    def create
        @user = User.new({:user_id => params['user']['user_id'], :email => params['user']['email']})
        if !(User.exists?(user_id: @user.user_id))