app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "1"]]
---
   def set_current_user
      @current_user ||=	session[:session_token]	&& User.find_by_session_token(session[:session_token])

SELECT  1 AS one FROM "users" WHERE ("users"."user_id" = '5' AND "users"."id" != 9) LIMIT 1
INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "pop"], ["email", "pop"], ["session_token", "qj4+eQYgPDv+7496r69H/Q=="], ["created_at", "2015-10-09 03:21:09.664941"], ["updated_at", "2015-10-09 03:21:09.664941"]]
---
   def create
      @user = User.new(user_params)
      if User.exists?(user_id: @user.user_id)
         flash[:notice] = "User ID is taken"
         redirect_to "/users/new"
      else
         @user.create_user!({"user_id" => @user.user_id, "email" => @user.email})